# На вход программы подаются результаты измерений, выполняемых прибором с интервалом 1 минуту.
# Все данные – целые числа (возможно, отрицательные).
# Требуется найти наибольшую сумму двух результатов измерений, выполненных с интервалом не менее, чем в 7 минут.
# Описание входных данных
# В первой строке вводится одно целое положительное число – количество измерений N, которое может быть очень велико.
# Гарантируется, что N > 7. Каждая из следующих N строк содержит по одному целому числу – результат очередного измерения.
# Описание выходных данных
# Программа должна вывести одно число наибольшую сумму двух результатов измерений, выполненных с интервалом не менее, чем в 7 минут.
# Пример входных данных:
# 10
# 1
# 2
# 3
# 4
# 5
# 6
# 7
# 8
# 9
# 10
# Пример выходных данных для приведённого выше примера входных данных:
# 13


# мой вариант
from math import inf

n = int(input())
m = 7
win = [0] * m

m1 = sm = -inf

for i in range(m):
	win[i] = int(input())

for i in range(m, n):
	cur = int(input())
	prev = win[i%m]
	win[i%m] = cur

	if prev > m1:
		m1 = prev

	if cur + m1 > sm:
		sm = cur + m1

print(sm)



# в критериях
# n = int(input())
# m = 7
# win = [0] * m

# for i in range(m):
# 	win[i] = int(input())

# for i in range(m, n):
# 	cur = int(input())
# 	prev = win[i%m]
# 	win[i%m] = cur

# 	if i == m:
# 		m1 = prev
# 		sm = prev + cur

# 	if prev > m1:
# 		m1 = prev

# 	if cur + m1 > sm:
# 		sm = cur + m1

# print(sm)
